app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    @animals = Animal.all

INSERT INTO "animals" ("image", "name", "action", "type", "temp", "location") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["image", nil], ["name", "Tiger"], ["action", nil], ["type", nil], ["temp", nil], ["location", nil]]
---
  def create
    @animal = Animal.new(animal_params)

    if @animal.save

DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 1]]
---
  def destroy
    @animal.destroy

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_animal
      @animal = Animal.find(params[:id])